{
	"data": [
		{
			"type": "Food",
			"source": "Foraging",
			"speed": "0.310 F/s",
			"note": "Forage bushes are usually used at the game as second or third food option, before farms. Very often a Mill is build close to it, fastening the gathering. However, bushes are very vulnerable to overcrowding, decreasing the productivity."
		},
		{
			"type": "Food",
			"source": "Sheep/Turkey/Cow",
			"speed": "0.330 F/s",
			"note": "Sheeps (or turkeys if you're playing on a mesoamerican map) have a interesting attribute: they can be positioned underneath the Town Center, nullifying the walk time. Usually only two sheeps are placed in the Town Center per time (yes, this requires some micromanagement and experience). Probably, the only downside is that you have to search for them."
		}, 
		{
			"type": "Food",
			"source": "Sheep/Turkey/Cow with Britons",
			"speed": "0.408 F/s",
			"note": "Sheep are specially important for Britons. Finding about 12-14 sheep on land nomad can be enough for them to very quickly reach the Castle Age."
		},
		{
			"type": "Food",
			"source": "Farming",
			"speed": "0.33 - 0.41 F/s",
			"note": "0.33 F/s without upgrades, 0.38 F/s with Wheelbarrow+Heavy Plow, 0.41 F/s after Hand Cart (<a href=\"https://1drv.ms/f/s!Ark-SUz3-qr5qROIwgp19j7Ml9-u\">Tests</a>). The real farming speed also depends on the walking distance and villager speed and carrying capacity (wheelbarrow and handcart). They require wood and a mill. Also, farms can be upgraded with the Horse Collar, Heavy Plow and Crop Rotation, to increase a maximum amount of food. A player needs to have caution when <a href=\"http://www.cysion.be/aocbox/?p=1318\">placing</a> them to have the optimal results!"
		},
		{
			"type": "Food",
			"source": "Farming with Mayans",
			"speed": "0.32 - 0.39 F/s",
			"note": "0.32 F/s without upgrades, 0.35 F/s with Wheelbarrow+Heavy Plow, 0.39 F/s after Hand Cart (<a href=\"https://1drv.ms/f/s!Ark-SUz3-qr5qROIwgp19j7Ml9-u\">Tests</a>). <br />\"Mayan farmers effectively work 15% slower, however, because a lot of the farming is actually 'running around on the farm', the real effect is roughly 5% slower.\"(cysion)"
		},
		{
			"type": "Food",
			"source": "Farming with Aztecs",
			"speed": "0.38 - 0.42 F/s",
			"note": "0.38 F/s without upgrades, 0.40 F/s with Wheelbarrow+Heavy Plow, 0.42 F/s after Hand Cart (<a href=\"https://1drv.ms/f/s!Ark-SUz3-qr5qROIwgp19j7Ml9-u\">Tests</a>). This speed improvement is due to the +5 carrying capacity."
		},
		{
			"type": "Food",
			"source": "Boars",
			"speed": "0.41 F/s",
			"note": "These animals fight back when attacked, althought they rush the villagers who shot at them blindly. This way they can be lured to the Town Center to nullify the walking time, pretty much like sheeps, except that you cannot actively control them. Most random maps have 2 of them close to your city, which are very useful. In some cases, it might be necessary to research Loom before luring to avoid the villager dying to the boar."
		},
		{
			"type": "Food",
			"source": "Boars with Mongols",
			"speed": "0.610 F/s",
			"note": ""
		},
		{
			"type": "Food",
			"source": "Deer",
			"speed": "0.41 F/s",
			"note": "Deer, unlike Boars, flee when attacked, or when a unit comes near them. Because of this attribute, it's quite difficult to lure them closer to the Town Center, althought a Scout can do the trick. But, usually, players build a Mill close to the pocket. There are usually 2 pockets of Deer per player in a random game"
		},
		{
			"type": "Food",
			"source": "Deer with Mongols",
			"speed": "0.610 F/s",
			"note": ""
		},
		{
			"type": "Food",
			"source": "Fishing with villagers",
			"speed": "0.43 F/s",
			"note": "The type of fish (deep or shore) makes no difference in speed. Fishing shore fish with villagers is faster than with Fishing Ships, but has the obvious disadvantage of only being able to fish near the shore. Also, before the researching of wheelbarrow they can't carry more than 10, whilst ships can carry 15 units. Also, they usually require a mill nearby, because the Town Center is usually far away."
		},
		{
			"type": "Food",
			"source": "Fishing deep fish",
			"speed": "0.49 F/s",
			"note": "Ship fishing is a good alternate in maps that has lakes and seas. Sea economy expand very quickly, when compared to villager based economies. They can expand even in Dark Age, whilst villager economies show great expansion only at the Castle Age beyond."
		},
		{
			"type": "Food",
			"source": "Fishing deep fish with japanese",
			"speed": "0.511 - 0.584 F/s",
			"note": "Japanese have a bonus to their fishing ship fishing speeds 5% in Dark, 10% in Feudal, 15% in Castle and 20% in Imperial. These correspond to 0.511 F/s in Dark age, 0.536 F/s in Feudal Age, 0.559 F/s in Castle age and 0.585 F/s in Imperial Age 0.33 F/s without upgrades, 0.38 F/s with Wheelbarrow+Heavy Plow, 0.41 F/s after Hand Cart (<a href=\"https://1drv.ms/f/s!Ark-SUz3-qr5qRSkwXtCvEJ5-88m\">Tests</a>). Note these values hold only when the fishing ship doesn't have to move to drop off resources. Real values will be lower based on the distance."
		},
		{
			"type": "Food",
			"source": "Fishing shore fish",
			"speed": "0.280 F/s",
			"note": "Fishing shore fish with fishing ships should be avoided and only using it if deep fish is very far (<a href=\"https://1drv.ms/f/s!Ark-SUz3-qr5qRSkwXtCvEJ5-88m\">Tests</a>)."
		},
		{
			"type": "Food",
			"source": "Fishing shore fish with japanese",
			"speed": "0.294 - 0.336 F/s",
			"note": "Japanese have a bonus to their fishing ship fishing speeds 5% in Dark, 10% in Feudal, 15% in Castle and 20% in Imperial. These correspond to 0.294 F/s in Dark age, 0.308 F/s in Feudal Age, 0.322 F/s in Castle age and 0.336 F/s in Imperial Age. Note these values hold only when the fishing ship doesn't have to move to drop off resources. Real values will be lower based on the distance."
		},
		{
			"type": "Food",
			"source": "Fish traps with japanese",
			"speed": "0.375 - 0.407 F/s",
			"note": "Usually used fish has run out. Gives quite good wood to food ratio. Japanese get faster fishing ship by 5% in each age. Experimental results - 0.375 F/s in Feudal, 0.391 F/s in Castle and 0.407 F/s in Imperial age (<a href=\"https://1drv.ms/f/s!Ark-SUz3-qr5qRXNLlEPG9Ii3Zuy\">Tests</a>)."
		},
		{
			"type": "Food",
			"source": "Fish traps",
			"speed": "0.342 F/s",
			"note": "Usually used fish has run out. Gives quite good wood to food ratio. In realistic <a href=\"https://1drv.ms/f/s!Ark-SUz3-qr5qRXNLlEPG9Ii3Zuy\">tests</a> 0.342 F/s (when directly adjacent to the dock)."
		},
		{
			"type": "Wood",
			"source": "Chopping",
			"speed": "0.388 - 0.615 W/s",
			"note": "0.466 W/s after Double-Bit Axe (x1.2), 0.559 W/s after Bow Saw (x1.2) and 0.615 W/s after Two-Man Saw (x1.1). Wood is harvested from trees. Obviously, not every forest is close to a Town Center, so a Lumber Mill (or another Town Center) is an almost obligatory requisite for an efficient wood gathering."
		},
		{
			"type": "Wood",
			"source": "Chopping with Celts",
			"speed": "0.444 - 0.643 W/s",
			"note": "Celtic lumberjacks start with a 15% bonus efficiency. 0.535 W/s after Double-Bit Axe (x1.2) and 0.643 W/s after Bow Saw (x1.2)"
		},
		{
			"type": "Gold",
			"source": "Mining",
			"speed": "0.379 G/s",
			"note": "0.436 G/s after Gold mining (x1.15) and 0.501 G/s after Gold Shaft Mining (x1.15). Gold is possibly the most important resource in the game, because without gold, only three military units types are available (Spear line, Skirmisher line and Scout line, which are cheerfully called as 'trash'). Gold mining is the primary gold source; and the initial mine clump, has seven mines. Relics can be found in the map, and each grant a permanent trinkle of gold."
		},
		{
			"type": "Gold",
			"source": "Mining with Turks",
			"speed": "0.435 G/s",
			"note": "Turks get 15 % gold mining bonus (gold mining work rate x 1.15). 0.501 G/s after Gold mining (x1.15) and 0.576 G/s after Gold Shaft Mining (x1.15)."
		},
		{
			"type": "Gold",
			"source": "Relic",
			"speed": "0.5 G/s",
			"note": "Relics generate 1 gold every 2 seconds"
		},
		{
			"type": "Gold",
			"source": "Relic with Aztecs",
			"speed": "0.67 G/s",
			"note": "Aztecs get a 33% gold generation bonus."
		},
		{
			"type": "Stone",
			"source": "Mining",
			"speed": "0.359 - 0.475 S/s",
			"note": "0.413 S/s after Stone mining (x1.15) and 0.475 S/s after Stone Shaft Mining (x1.15). Stone can only be harvested from stone mines. It also has the highest place in the market. Stone isn't used for units, but some technologies require it. It's greatest use is obviously for creating buildings. Town Centers, Outposts, Castles, Towers, Walls, Gates and Wonders all require large amounts of stone. Its mining rate can be upgraded with Stone Mining and Stone Shaft Mining."
		},
		{
			"type": "Stone",
			"source": "Mining with Koreans",
			"speed": "0.431 - 0.570 S/s",
			"note": "Korean stone miners get a 20% work rate bonus (1.2 x work rate). 0.495 S/s after Stone mining (x1.15) and 0.570 S/s after Stone Shaft Mining (x1.15)."
		}
	]
}